results/wrk2/oraclejdk8/jsonpost.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R47000 -L -v -s src/test/lua/jsonPost.lua http://localhost:9000/json
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/json
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.398ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.417ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.403ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.405ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.50ms    1.30ms  28.13ms   93.94%
    Req/Sec    12.40k     1.17k   22.78k    77.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.74ms
 90.000%    2.39ms
 99.000%    7.34ms
 99.900%   15.57ms
 99.990%   22.64ms
 99.999%   25.74ms
100.000%   28.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.117     0.000000            3         1.00
       0.601     0.100000       234900         1.11
       0.773     0.200000       469431         1.25
       0.925     0.300000       704446         1.43
       1.079     0.400000       939836         1.67
       1.241     0.500000      1174575         2.00
       1.325     0.550000      1291526         2.22
       1.414     0.600000      1408914         2.50
       1.510     0.650000      1526037         2.86
       1.618     0.700000      1643024         3.33
       1.744     0.750000      1760382         4.00
       1.818     0.775000      1819670         4.44
       1.900     0.800000      1878067         5.00
       1.995     0.825000      1936950         5.71
       2.103     0.850000      1995643         6.67
       2.229     0.875000      2054189         8.00
       2.303     0.887500      2083378         8.89
       2.387     0.900000      2112679        10.00
       2.487     0.912500      2142152        11.43
       2.607     0.925000      2171338        13.33
       2.761     0.937500      2200467        16.00
       2.861     0.943750      2215234        17.78
       2.983     0.950000      2229809        20.00
       3.139     0.956250      2244466        22.86
       3.355     0.962500      2259192        26.67
       3.685     0.968750      2273819        32.00
       3.935     0.971875      2281169        35.56
       4.259     0.975000      2288496        40.00
       4.687     0.978125      2295819        45.71
       5.203     0.981250      2303193        53.33
       5.831     0.984375      2310479        64.00
       6.195     0.985938      2314169        71.11
       6.591     0.987500      2317836        80.00
       7.043     0.989062      2321494        91.43
       7.547     0.990625      2325153       106.67
       8.163     0.992188      2328816       128.00
       8.535     0.992969      2330684       142.22
       8.935     0.993750      2332502       160.00
       9.423     0.994531      2334325       182.86
       9.975     0.995313      2336158       213.33
      10.639     0.996094      2337996       256.00
      11.039     0.996484      2338922       284.44
      11.503     0.996875      2339821       320.00
      12.039     0.997266      2340736       365.71
      12.631     0.997656      2341664       426.67
      13.303     0.998047      2342579       512.00
      13.663     0.998242      2343037       568.89
      14.063     0.998437      2343486       640.00
      14.527     0.998633      2343951       731.43
      15.095     0.998828      2344403       853.33
      15.647     0.999023      2344864      1024.00
      15.943     0.999121      2345096      1137.78
      16.255     0.999219      2345319      1280.00
      16.575     0.999316      2345550      1462.86
      16.943     0.999414      2345784      1706.67
      17.343     0.999512      2346008      2048.00
      17.599     0.999561      2346122      2275.56
      17.903     0.999609      2346239      2560.00
      18.207     0.999658      2346353      2925.71
      18.607     0.999707      2346464      3413.33
      19.183     0.999756      2346579      4096.00
      19.519     0.999780      2346638      4551.11
      19.983     0.999805      2346693      5120.00
      20.703     0.999829      2346752      5851.43
      21.439     0.999854      2346808      6826.67
      22.175     0.999878      2346865      8192.00
      22.447     0.999890      2346894      9102.22
      22.671     0.999902      2346924     10240.00
      23.119     0.999915      2346951     11702.86
      23.711     0.999927      2346982     13653.33
      24.063     0.999939      2347008     16384.00
      24.303     0.999945      2347023     18204.44
      24.495     0.999951      2347039     20480.00
      24.639     0.999957      2347051     23405.71
      24.831     0.999963      2347068     27306.67
      25.023     0.999969      2347080     32768.00
      25.087     0.999973      2347089     36408.89
      25.215     0.999976      2347095     40960.00
      25.295     0.999979      2347101     46811.43
      25.407     0.999982      2347110     54613.33
      25.503     0.999985      2347117     65536.00
      25.535     0.999986      2347119     72817.78
      25.599     0.999988      2347124     81920.00
      25.647     0.999989      2347126     93622.86
      25.839     0.999991      2347130    109226.67
      26.031     0.999992      2347134    131072.00
      26.079     0.999993      2347135    145635.56
      26.127     0.999994      2347138    163840.00
      26.239     0.999995      2347139    187245.71
      26.495     0.999995      2347141    218453.33
      26.591     0.999996      2347143    262144.00
      26.591     0.999997      2347143    291271.11
      26.815     0.999997      2347144    327680.00
      26.895     0.999997      2347145    374491.43
      26.911     0.999998      2347146    436906.67
      27.167     0.999998      2347147    524288.00
      27.167     0.999998      2347147    582542.22
      27.183     0.999998      2347148    655360.00
      27.183     0.999999      2347148    748982.86
      27.583     0.999999      2347149    873813.33
      27.583     0.999999      2347149   1048576.00
      27.583     0.999999      2347149   1165084.44
      27.839     0.999999      2347150   1310720.00
      27.839     0.999999      2347150   1497965.71
      27.839     0.999999      2347150   1747626.67
      27.839     1.000000      2347150   2097152.00
      27.839     1.000000      2347150   2330168.89
      28.143     1.000000      2347151   2621440.00
      28.143     1.000000      2347151          inf
#[Mean    =        1.496, StdDeviation   =        1.304]
#[Max     =       28.128, Total count    =      2347151]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2818624 requests in 1.00m, 1.03GB read
Requests/sec:  46977.74
Transfer/sec:     17.61MB